app/models/app/AppVersion.php

SELECT * FROM `app_version` WHERE ((date_deleted is NULL) AND (app_name=myzd)) AND (os=ios) ORDER BY `app_version` DESC LIMIT 1
---
    public function getLastestVersionByOSAndAppName($os, $app_name) {
        // TODO: add 'date_active'. $now > $date_active.
        $criteria = new \yii\db\ActiveQuery('app\models\app\AppVersion');
        $criteria->andWhere('date_deleted is NULL');
        $criteria->andWhere('app_name="'. $app_name.'"');
        $criteria->andWhere('os="'. $os.'"');
        $criteria->addOrderBy('app_version DESC');
        $criteria->limit = 1;
        $ret = $criteria->all();