app/models/auth/AuthTokenUser.php

SELECT * FROM `user` WHERE `id`=100549
---
    public function getFirstActiveByUserId($userId) {
        $criteria = new CDbCriteria();
        $criteria->addCondition("t.date_deleted is NULL");
        $criteria->compare("t.user_id", $userId);
        $criteria->compare("t.is_active", '1');
        return $this->find($criteria);