app/models/PayManager.php

INSERT INTO `sales_payment` (`order_id`, `user_id`, `uid`, `bill_amount`, `bill_currency`, `bill_date`, `payment_status`, `pay_channel`, `date_created`, `date_updated`) VALUES (1775, NULL, '59BB15E62C709CD0789CEC8817E7E40F', '200.00', 'RMB', NOW(), 0, 'alipay_wap', NOW(), NOW())
INSERT INTO `sales_payment_data` (`payment_id`, `date_request`, `request_data`, `date_created`, `date_updated`) VALUES (1341, NOW(), '{}', NOW(), NOW())
---
       // $payment->update(true,array('ping_charge_id'));
        $paymentData = new SalesPaymentData();
        $paymentData->initFromPayment($payment, $pingCharge);
        if ($paymentData->save() === false) {